 let FeatureStyles = {
    210101: {   //河流
        Ft: "A",
        Cr: "#96969688",
        Fc: "#BFEFFF88",
        Lw: 0.0,
    },
    230100: {   //湖、塘
        Ft: "A",
        Cr: "#96969688",
        Fc: "#BFEFFF88",
        Lw: 0.0,
    },
    230101: {   //湖泊
        Ft: "A",
        Cr: "#96969688",
        Fc: "#BFEFFF88",
        Lw: 0.0,
    },
    240101: {   //水库
        Ft: "A",
        Cr: "#96969688",
        Fc: "#BFEFFF88",
        Lw: 0.0,
    },
    310104: {       //地级市
        Ft: "A",
        Cr: "#8A8A8A88",
        Fc: "#8A8A8A88",
        Lw: 0.0,
    },
    310105: {       //县级市
        Ft: "A",
        Cr: "#B5B5B588",
        Fc: "#B5B5B588",
        Lw: 0.0,
    },
    defaultA: {
        Ft: "A",
        Cr: "#6495ED",
        Fc: "#000000",
        Lw: 0.0,
    },
    710101: {       //等高线
        Ft: "L",
        Cr: "#969696",
        Lw: 0.3 , 
    },
    defaultL: {
        Ft: "L",
        Cr: "#DEDEDE",
        Lw: 1.0,
    },
    420101: {   //国道
        Ft: "L",
        Cr: "#EED5B7",
        Lw: 1.0, 
    },
    420201: {     //省道
        Ft: "L",
        Cr: "#96969688",
        Lw: 0.8,
    },
    480105: {     //方块,跑道
        Ft: "L",
        Cr: "#080808",
        Lw: 2.0,
    },
    410102: {     //标准轨
        Ft: "RW",
        Lw: 2.0,
    },
    410202: {     //窄轨
        Ft: "RW",
        Lw: 1.5,
    },
    480307: {     //航迹引导线，直线+箭头
        Ft: "ArrowL",
        Cr: "#080808",
        Lw: 1.5,
    },
    480314: {       //等待程序线，两个半圈+箭头
        Ft: "ArrowL",
        Cr: "#080808",
        Lw: 1.5,
    },
    480315: {       //复飞程序线，半圈+箭头
        Ft: "ArrowL",
        Cr: "#080808",
        Lw: 1.5,
    },
    480210: {     //双短横线
        Ft: "L",
        Cr: "#BF3EFF",
        Lw: 1.0,
        hide: true
    },
    480208: {  //右下角圆形和指示线
        Ft: "L",
        Cr: "#080808",
        Lw: 1.0,
    },
    480470: {   //机场大圆
        Ft: "L",
        Cr: "#080808",
        Lw: 1.5,
    },
    480316: {
        hide: true
    },
    defaultP: {
        Ft: "P",
        Cr: "#FF0000"
    },
    480201: {
        Ft: "P",
        Url: "icon/480201.png",
    },
    480212: {
        Ft: "P",
        hide: true
    },
    489200: {
        Ft: "P",
        hide: true
    },
    480317: {
        Ft: "P",
        Url: "icon/480317.png"
    },
    480318: {
        Ft: "P",
        Url: "icon/480318.png"
    },
    720100: {   //高程点
        Ft: "P",
        Cr: "#080808",
        rd: 2
    },
    720800: {   //等高面
        Ft: "A",
    },
    760400: {   //飞行障碍物
        Ft: "P",
        Url: "icon/760400.png"
    },
    
}
 
//export { FeatureStyles};